app/views/questionnaires/show.html.haml

SELECT  "question_answers".* FROM "question_answers" WHERE "question_answers"."id" = ? LIMIT 1  [["id", nil]]
---
          %label="Question Number "+numberQuestion.to_s
          - @question_answer = QuestionAnswer.where(id:answer.idquestion)