app/controllers/question_answers_controller.rb

SELECT "question_answers".* FROM "question_answers"
---
  def index
    @question_answers = QuestionAnswer.all

INSERT INTO "question_answers" ("question", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @question_answer = QuestionAnswer.new(question_answer_params)

    respond_to do |format|
      if @question_answer.save

SELECT  "question_answers".* FROM "question_answers" WHERE "question_answers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_question_answer
      @question_answer = QuestionAnswer.find(params[:id])