app/controllers/questions_and_anwers_controller.rb

  def index
    @questions_and_anwers = QuestionsAndAnwer.all
---
SELECT "questions_and_anwers".* FROM "questions_and_anwers"

  def show
    @questions_and_anwer = QuestionsAndAnwer.find(params[:id])
---
SELECT "questions_and_anwers".* FROM "questions_and_anwers" WHERE "questions_and_anwers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @questions_and_anwer = QuestionsAndAnwer.find(params[:id])
---
SELECT "questions_and_anwers".* FROM "questions_and_anwers" WHERE "questions_and_anwers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @questions_and_anwer = QuestionsAndAnwer.new(params[:questions_and_anwer])

    respond_to do |format|
      if @questions_and_anwer.save
---
INSERT INTO "questions_and_anwers" ("answer", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["answer", nil], ["created_at", Thu, 28 Jul 2016 03:19:02 UTC +00:00], ["question", nil], ["updated_at", Thu, 28 Jul 2016 03:19:02 UTC +00:00]]

  def update
    @questions_and_anwer = QuestionsAndAnwer.find(params[:id])

    respond_to do |format|
      if @questions_and_anwer.update_attributes(params[:questions_and_anwer])
---
SELECT "questions_and_anwers".* FROM "questions_and_anwers" WHERE "questions_and_anwers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "questions_and_anwers" SET "question" = 'What is your name', "answer" = 'roger', "updated_at" = '2016-07-28 03:42:42.810452' WHERE "questions_and_anwers"."id" = 1