app/controllers/questionnaires_controller.rb

  def show
    @questionnaire = Questionnaire.find(params[:id])
    @questionnaireDetail = Questionnairedetail.where(questionnaire_id: @questionnaire.id)
---
SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = ? LIMIT 1  [["id", 1]]
SELECT "questionnairedetails".* FROM "questionnairedetails" WHERE "questionnairedetails"."questionnaire_id" = ?  [["questionnaire_id", 1]]

  def create

    @questionnaire = Questionnaire.new
    if @questionnaire.save
      @questionnaire.title="Test "+@questionnaire.id.to_s
      @questionnaire.save
      params.each do |param,answerUser|
        if param.index("input")
          arr=param.split('_')
          if arr.length.to_i > 0
            questionid=arr[1]
            @questionnaireDetail= Questionnairedetail.new
            @questionnaireDetail.answerUser=answerUser
            @questionnaireDetail.idquestion=questionid.to_i
            @questionnaireDetail.eval=eval(questionid,answerUser)
            @questionnaireDetail.questionnaire_id=@questionnaire.id
            @questionnaireDetail.save
---
INSERT INTO "questionnairedetails" ("answerUser", "idquestion", "eval", "questionnaire_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["answerUser", "32"], ["idquestion", 1], ["eval", "CORRECT"], ["questionnaire_id", 1], ["created_at", "2016-07-30 00:40:40.680870"], ["updated_at", "2016-07-30 00:40:40.680870"]]