app/controllers/questionnaires_controller.rb

  def index
    @questionnaires = Questionnaire.all
---
SELECT "questionnaires".* FROM "questionnaires"

  def show
    @questionnaire = Questionnaire.where(questionnairesnumber: params[:id])
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."questionnairesnumber" = ?  [["questionnairesnumber", 1]]

  def new
    @questionnaire = Questionnaire.new
    @question_answers = QuestionAnswer.all
---
SELECT "question_answers".* FROM "question_answers"

  def create
    arrayAnswer = Array.new
    params.each do |param,answerUser|
      if param.index("input")
        arr=param.split('_')
        questionid=arr[1]
        arrayAnswer.push(questionid.to_s+'_'+answerUser+'_'+eval(questionid,answerUser))
      end
    end

    if arrayAnswer.length.to_i > 0
      @questionnaire = Questionnaire.new
      @questionnaire.save
      @idquestionnaire=@questionnaire.id
      arrayAnswer.each do |val|
        arr= val.split('_')
        @questionnaire.idquestion=arr[0].to_i
        @questionnaire.answerUser=arr[1]
        @questionnaire.eval=arr[2]
        @questionnaire.questionnairesnumber=@idquestionnaire
        @questionnaire.save
        @questionnaire = Questionnaire.new
      end
    end

    #respond_to do |format|
      @questionnaire = Questionnaire.where(questionnairesnumber: @idquestionnaire.to_i)
      @question_answers = QuestionAnswer.all
---
INSERT INTO "questionnaires" ("idquestion", "answerUser", "eval", "questionnairesnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["idquestion", 2], ["answerUser", "5"], ["eval", "CORRECT"], ["questionnairesnumber", 4], ["created_at", "2016-07-29 07:22:19.792824"], ["updated_at", "2016-07-29 07:22:19.792824"]]
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."questionnairesnumber" = ?  [["questionnairesnumber", 6]]
SELECT "question_answers".* FROM "question_answers"